# PANDAS

In [1]:
pip install pandas

Requirement already satisfied: pandas in c:\users\vigne\anaconda3\lib\site-packages (1.4.4)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\vigne\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\vigne\anaconda3\lib\site-packages (from pandas) (2022.1)
Requirement already satisfied: numpy>=1.18.5 in c:\users\vigne\anaconda3\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in c:\users\vigne\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
import numpy as np

### Series

In [4]:
#its a one D array that can hold data of anytype

In [5]:
s = pd.Series(np.random.rand(5))

In [6]:
s

0    0.875632
1    0.794848
2    0.785003
3    0.424374
4    0.486170
dtype: float64

In [7]:
s[3]

0.42437394131838335

In [8]:
s[4]

0.4861699590292803

In [9]:
s[0::]

0    0.875632
1    0.794848
2    0.785003
3    0.424374
4    0.486170
dtype: float64

In [10]:
s[2] = 5.4321

In [11]:
s

0    0.875632
1    0.794848
2    5.432100
3    0.424374
4    0.486170
dtype: float64

In [12]:
s = pd.Series(np.random.rand(5),index = ['a','b','c','d','e'])

In [13]:
s

a    0.563908
b    0.306901
c    0.924028
d    0.749498
e    0.490177
dtype: float64

In [14]:
s.argmax()

2

In [15]:
s.argmin()

1

In [16]:
s.mean()

0.6069026637133892

In [17]:
s.median()

0.5639084949008714

In [18]:
s.mode()

0    0.306901
1    0.490177
2    0.563908
3    0.749498
4    0.924028
dtype: float64

In [19]:
s.max()

0.9240282833694831

In [20]:
s.min()

0.30690105151496383

In [21]:
arr = np.array([1,2,3,4])

In [22]:
s1 = pd.Series(arr) #coverting array to series

In [23]:
s1

0    1
1    2
2    3
3    4
dtype: int32

### Using Dictionary

In [24]:
d = {'a':1,'b':2,'c':3,'d':4}

In [25]:
d

{'a': 1, 'b': 2, 'c': 3, 'd': 4}

In [26]:
d_series = pd.Series(d)

In [27]:
d_series

a    1
b    2
c    3
d    4
dtype: int64

In [28]:
type(d_series)

pandas.core.series.Series

In [29]:
d_series.drop('a')

b    2
c    3
d    4
dtype: int64

## DATAFRAMES

Structured dataset : proper rows and columns\
Unstructured dataset : improper rows and columns

DataSet : A Dataset is the basic data container in PyMVPA. It serves as the primary form of data storage, but also as a common container for results returned by most algorithms.

PyMVPA : PyMVPA is a Python package intended to ease statistical learning analyses of large datasets. It offers an extensible framework with a high-level interface to a broad range of algorithms for classification, regression, feature selection, data import and export. It is designed to integrate well with related software packages, such as scikit-learn, shogun, MDP, etc. While it is not limited to the neuroimaging domain, it is eminently suited for such datasets. PyMVPA is free software and requires nothing but free-software to run.

PyMVPA stands for MultiVariate Pattern Analysis (MVPA) in Python.

In [32]:
s1 = pd.Series(np.random.rand(5))
s2 = pd.Series(np.random.rand(5))

In [34]:
print(s1)
print("-----------------")
print(s2)

0    0.460043
1    0.791088
2    0.850194
3    0.362507
4    0.365015
dtype: float64
-----------------
0    0.837837
1    0.044595
2    0.797013
3    0.261357
4    0.608594
dtype: float64

In [37]:
a = pd.DataFrame([s1,s2])

In [38]:
a

          0         1         2         3         4
0  0.460043  0.791088  0.850194  0.362507  0.365015
1  0.837837  0.044595  0.797013  0.261357  0.608594

In [39]:
d = {'age':[22,23,24,25],'salary' : [1000,2000,3000,4000]}
d

{'age': [22, 23, 24, 25], 'salary': [1000, 2000, 3000, 4000]}

In [40]:
type(d)

dict

In [41]:
df = pd.DataFrame(d)

In [42]:
df

   age  salary
0   22    1000
1   23    2000
2   24    3000
3   25    4000

In [45]:
df['gender']=['male','male',"male",'female'] #adding column to the datafarme

In [46]:
df

   age  salary  gender
0   22    1000    male
1   23    2000    male
2   24    3000    male
3   25    4000  female

In [51]:
data = [['ab3c',1],['def',2],['ghi',3],['hij'],['kim',4]]

In [52]:
data

[['ab3c', 1], ['def', 2], ['ghi', 3], ['hij'], ['kim', 4]]

In [55]:
dataTable = pd.DataFrame(data,columns = ['A','B'])

In [56]:
dataTable

      A    B
0  ab3c  1.0
1   def  2.0
2   ghi  3.0
3   hij  NaN
4   kim  4.0

In [61]:
#changing the index

In [62]:
data2 = pd.DataFrame(data,index = ['A','B','C','D','E'])

In [63]:
data2

      0    1
A  ab3c  1.0
B   def  2.0
C   ghi  3.0
D   hij  NaN
E   kim  4.0

In [64]:
marks = [['priya','maths',90],['Alex','physics',80],['john','social',50]]

In [66]:
d1=pd.DataFrame(marks,columns = ['name','subject','marks'])

In [67]:
d1

    name  subject  marks
0  priya    maths     90
1   Alex  physics     80
2   john   social     50

In [72]:
d1.rename({'marks' : 'Marks'},axis = 1)  #change in columns

    name  subject  Marks
0  priya    maths     90
1   Alex  physics     80
2   john   social     50

In [73]:
d1.rename({0 : 'A'},axis = 0) #change in rows

    name  subject  marks
A  priya    maths     90
1   Alex  physics     80
2   john   social     50

### LOC and iLOC function

In [78]:
df

   age  salary  gender
0   22    1000    male
1   23    2000    male
2   24    3000    male
3   25    4000  female

In [79]:
df.iloc[2]

age         24
salary    3000
gender    male
Name: 2, dtype: object

In [80]:
df.loc[2]

age         24
salary    3000
gender    male
Name: 2, dtype: object

In [82]:
df.iloc[:,2]

0      male
1      male
2      male
3    female
Name: gender, dtype: object

loc is used to select rows and columns by label, while iloc is used to select rows and columns by position.

In [83]:
df.iloc[0:2,1:]

   salary gender
0    1000   male
1    2000   male

In [85]:
df.iloc[2:4,0:2]

   age  salary
2   24    3000
3   25    4000

In [86]:
df

   age  salary  gender
0   22    1000    male
1   23    2000    male
2   24    3000    male
3   25    4000  female

In [88]:
df.loc[:,['age','gender']]

   age  gender
0   22    male
1   23    male
2   24    male
3   25  female

In [89]:
df.loc[:,['salary']]

   salary
0    1000
1    2000
2    3000
3    4000

In [90]:
df.shape

(4, 3)

In [93]:
newdf = df.drop(3)

In [94]:
newdf.shape

(3, 3)

In [95]:
newdf.columns

Index(['age', 'salary', 'gender'], dtype='object')

In [98]:
newdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   age     3 non-null      int64
 1   salary  3 non-null      int64
 2   gender  3 non-null      object
dtypes: int64(2), object(1)
memory usage: 200.0+ bytes

In [99]:
newdf.dtypes

age        int64
salary     int64
gender    object
dtype: object

In [100]:
newdf.isnull()

     age  salary  gender
0  False   False   False
1  False   False   False
2  False   False   False

In [102]:
newdf.isnull().any()

age       False
salary    False
gender    False
dtype: bool

In [103]:
newdf.isnull().sum()

age       0
salary    0
gender    0
dtype: int64

In [104]:
data2

      0    1
A  ab3c  1.0
B   def  2.0
C   ghi  3.0
D   hij  NaN
E   kim  4.0

In [105]:
data2.isnull()

       0      1
A  False  False
B  False  False
C  False  False
D  False   True
E  False  False

In [106]:
data2.isnull().any()

0    False
1     True
dtype: bool

In [107]:
data2.isnull().sum()

0    0
1    1
dtype: int64

In [108]:
#axis = 1 for columns
#axis = 0 for rows

In [109]:
data2.duplicated()

A    False
B    False
C    False
D    False
E    False
dtype: bool

In [117]:
df = pd.DataFrame({'Bike':['Yamaha','Hero','Honda','KTM','Bajaj','KTM','Honda'],'cc':[200,220,300,125,220,390,200]})

In [118]:
df

     Bike   cc
0  Yamaha  200
1    Hero  220
2   Honda  300
3     KTM  125
4   Bajaj  220
5     KTM  390
6   Honda  200

In [119]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
dtype: bool

In [122]:
df = df.drop_duplicates()

In [123]:
df

     Bike   cc
0  Yamaha  200
1    Hero  220
2   Honda  300
3     KTM  125
4   Bajaj  220
5     KTM  390
6   Honda  200